backend: tensorflow
class_name: Functional
config:
  input_layers:
  - - mz_array
    - 0
    - 0
  - - intensity_array
    - 0
    - 0
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - 89
      dtype: float32
      name: mz_array
      ragged: false
      sparse: false
    inbound_nodes: []
    name: mz_array
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - 89
      dtype: float32
      name: intensity_array
      ragged: false
      sparse: false
    inbound_nodes: []
    name: intensity_array
  - class_name: TFOpLambda
    config:
      dtype: float32
      function: stack
      name: tf.stack_1
      trainable: true
    inbound_nodes:
    - - - mz_array
        - 0
        - 0
        - &id001
          axis: -1
      - - intensity_array
        - 0
        - 0
        - *id001
    name: tf.stack_1
  - class_name: Text>RelativePositionEmbedding
    config:
      dtype: float32
      hidden_size: 12
      max_timescale: 10000.0
      min_timescale: 1.0
      name: relative_position_embedding
      trainable: true
    inbound_nodes:
    - - - tf.stack_1
        - 0
        - 0
        - {}
    name: relative_position_embedding
  - class_name: TFOpLambda
    config:
      dtype: float32
      function: expand_dims
      name: tf.expand_dims_1
      trainable: true
    inbound_nodes:
    - - relative_position_embedding
      - 0
      - 0
      - axis: 0
    name: tf.expand_dims_1
  - class_name: TFOpLambda
    config:
      dtype: float32
      function: compat.v1.shape
      name: tf.compat.v1.shape_3
      trainable: true
    inbound_nodes:
    - - tf.expand_dims_1
      - 0
      - 0
      - name: null
        out_type: &id002 !!python/object/apply:tensorflow.python.framework.dtypes.as_dtype
        - int32
    name: tf.compat.v1.shape_3
  - class_name: TFOpLambda
    config:
      dtype: float32
      function: compat.v1.shape
      name: tf.compat.v1.shape_2
      trainable: true
    inbound_nodes:
    - - tf.stack_1
      - 0
      - 0
      - name: null
        out_type: *id002
    name: tf.compat.v1.shape_2
  - class_name: SlicingOpLambda
    config:
      dtype: float32
      function: __operators__.getitem
      name: tf.__operators__.getitem_5
      trainable: true
    inbound_nodes:
    - - tf.compat.v1.shape_3
      - 0
      - 0
      - slice_spec:
          start: 1
          step: null
          stop: null
    name: tf.__operators__.getitem_5
  - class_name: SlicingOpLambda
    config:
      dtype: float32
      function: __operators__.getitem
      name: tf.__operators__.getitem_4
      trainable: true
    inbound_nodes:
    - - tf.compat.v1.shape_2
      - 0
      - 0
      - slice_spec: 0
    name: tf.__operators__.getitem_4
  - class_name: SlicingOpLambda
    config:
      dtype: float32
      function: __operators__.getitem
      name: tf.__operators__.getitem_6
      trainable: true
    inbound_nodes:
    - - tf.__operators__.getitem_5
      - 0
      - 0
      - slice_spec: 0
    name: tf.__operators__.getitem_6
  - class_name: SlicingOpLambda
    config:
      dtype: float32
      function: __operators__.getitem
      name: tf.__operators__.getitem_7
      trainable: true
    inbound_nodes:
    - - tf.__operators__.getitem_5
      - 0
      - 0
      - slice_spec: 1
    name: tf.__operators__.getitem_7
  - class_name: TFOpLambda
    config:
      dtype: float32
      function: broadcast_to
      name: tf.broadcast_to_1
      trainable: true
    inbound_nodes:
    - - tf.expand_dims_1
      - 0
      - 0
      - name: null
        shape: !!python/tuple
        - - tf.__operators__.getitem_4
          - 0
          - 0
        - - tf.__operators__.getitem_6
          - 0
          - 0
        - - tf.__operators__.getitem_7
          - 0
          - 0
    name: tf.broadcast_to_1
  - class_name: TimeDistributed
    config:
      dtype: float32
      layer:
        class_name: Dense
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dtype: float32
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer: null
          name: y_time_distributed_dense
          trainable: true
          units: 32
          use_bias: true
      name: time_distributed_1
      trainable: true
    inbound_nodes:
    - - - tf.stack_1
        - 0
        - 0
        - {}
    name: time_distributed_1
  - class_name: Conv1D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      dtype: float32
      filters: 16
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 1
      name: y_conv_1_16
      padding: same
      strides: !!python/tuple
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - tf.stack_1
        - 0
        - 0
        - {}
    name: y_conv_1_16
  - class_name: Conv1D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      dtype: float32
      filters: 32
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 4
      name: y_conv_4_32
      padding: same
      strides: !!python/tuple
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - tf.stack_1
        - 0
        - 0
        - {}
    name: y_conv_4_32
  - class_name: Conv1D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      dtype: float32
      filters: 48
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 16
      name: y_conv_16_48
      padding: same
      strides: !!python/tuple
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - tf.stack_1
        - 0
        - 0
        - {}
    name: y_conv_16_48
  - class_name: Conv1D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      dtype: float32
      filters: 64
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 64
      name: y_conv_64_64
      padding: same
      strides: !!python/tuple
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - tf.stack_1
        - 0
        - 0
        - {}
    name: y_conv_64_64
  - class_name: TFOpLambda
    config:
      dtype: float32
      function: concat
      name: tf.concat_1
      trainable: true
    inbound_nodes:
    - - - tf.broadcast_to_1
        - 0
        - 0
        - &id003
          axis: -1
      - - time_distributed_1
        - 0
        - 0
        - *id003
      - - y_conv_1_16
        - 0
        - 0
        - *id003
      - - y_conv_4_32
        - 0
        - 0
        - *id003
      - - y_conv_16_48
        - 0
        - 0
        - *id003
      - - y_conv_64_64
        - 0
        - 0
        - *id003
    name: tf.concat_1
  - class_name: Bidirectional
    config:
      dtype: float32
      layer:
        class_name: LSTM
        config:
          activation: tanh
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dropout: 0.0
          dtype: float32
          go_backwards: false
          implementation: 2
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer: null
          name: lstm
          recurrent_activation: sigmoid
          recurrent_constraint: null
          recurrent_dropout: 0.0
          recurrent_initializer:
            class_name: Orthogonal
            config:
              gain: 1.0
              seed: null
          recurrent_regularizer: null
          return_sequences: true
          return_state: false
          stateful: false
          time_major: false
          trainable: true
          unit_forget_bias: true
          units: 256
          unroll: false
          use_bias: true
      merge_mode: concat
      name: bidirectional_1
      trainable: true
    inbound_nodes:
    - - - tf.concat_1
        - 0
        - 0
        - {}
    name: bidirectional_1
  - class_name: GlobalMaxPooling1D
    config:
      data_format: channels_last
      dtype: float32
      name: global_max_pooling_over_time
      trainable: true
    inbound_nodes:
    - - - bidirectional_1
        - 0
        - 0
        - {}
    name: global_max_pooling_over_time
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: upscaling_dense_3
      trainable: true
      units: 1024
      use_bias: true
    inbound_nodes:
    - - - global_max_pooling_over_time
        - 0
        - 0
        - {}
    name: upscaling_dense_3
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: final_dense_layer_to_redefine_lengths
      trainable: true
      units: 240
      use_bias: true
    inbound_nodes:
    - - - upscaling_dense_3
        - 0
        - 0
        - {}
    name: final_dense_layer_to_redefine_lengths
  - class_name: TFOpLambda
    config:
      dtype: float32
      function: reshape
      name: tf.reshape_1
      trainable: true
    inbound_nodes:
    - - final_dense_layer_to_redefine_lengths
      - 0
      - 0
      - shape: !!python/tuple
        - -1
        - 30
        - 8
    name: tf.reshape_1
  - class_name: LSTM
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      dtype: float32
      go_backwards: false
      implementation: 2
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: lstm
      recurrent_activation: sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config:
          gain: 1.0
          seed: null
      recurrent_regularizer: null
      return_sequences: true
      return_state: false
      stateful: false
      time_major: false
      trainable: true
      unit_forget_bias: true
      units: 22
      unroll: false
      use_bias: true
    inbound_nodes:
    - - - tf.reshape_1
        - 0
        - 0
        - {}
    name: lstm
  - class_name: TFOpLambda
    config:
      dtype: float32
      function: math.reduce_max
      name: tf.math.reduce_max
      trainable: true
    inbound_nodes:
    - - lstm
      - 0
      - 0
      - axis: -1
        keepdims: true
    name: tf.math.reduce_max
  - class_name: TFOpLambda
    config:
      dtype: float32
      function: math.subtract
      name: tf.math.subtract
      trainable: true
    inbound_nodes:
    - - lstm
      - 0
      - 0
      - name: null
        y:
        - tf.math.reduce_max
        - 0
        - 0
    name: tf.math.subtract
  - class_name: TFOpLambda
    config:
      dtype: float32
      function: math.exp
      name: tf.math.exp
      trainable: true
    inbound_nodes:
    - - tf.math.subtract
      - 0
      - 0
      - {}
    name: tf.math.exp
  - class_name: TFOpLambda
    config:
      dtype: float32
      function: math.reduce_sum
      name: tf.math.reduce_sum
      trainable: true
    inbound_nodes:
    - - tf.math.exp
      - 0
      - 0
      - axis: -1
        keepdims: true
    name: tf.math.reduce_sum
  - class_name: TFOpLambda
    config:
      dtype: float32
      function: math.truediv
      name: tf.math.truediv
      trainable: true
    inbound_nodes:
    - - tf.math.exp
      - 0
      - 0
      - name: null
        y:
        - tf.math.reduce_sum
        - 0
        - 0
    name: tf.math.truediv
  name: mmproteo_lstm_with_pooling_and_position_pdeep_20211024-120457
  output_layers:
  - - tf.math.truediv
    - 0
    - 0
keras_version: 2.4.0
