Model: "mmproteo_lstm_with_pooling_and_position_pdeep_20211024-120457"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
mz_array (InputLayer)           [(None, 89)]         0                                            
__________________________________________________________________________________________________
intensity_array (InputLayer)    [(None, 89)]         0                                            
__________________________________________________________________________________________________
tf.stack_1 (TFOpLambda)         (None, 89, 2)        0           mz_array[0][0]                   
                                                                 intensity_array[0][0]            
__________________________________________________________________________________________________
relative_position_embedding (Re (89, 12)             0           tf.stack_1[0][0]                 
__________________________________________________________________________________________________
tf.expand_dims_1 (TFOpLambda)   (1, 89, 12)          0           relative_position_embedding[0][0]
__________________________________________________________________________________________________
tf.compat.v1.shape_3 (TFOpLambd (3,)                 0           tf.expand_dims_1[0][0]           
__________________________________________________________________________________________________
tf.compat.v1.shape_2 (TFOpLambd (3,)                 0           tf.stack_1[0][0]                 
__________________________________________________________________________________________________
tf.__operators__.getitem_5 (Sli (2,)                 0           tf.compat.v1.shape_3[0][0]       
__________________________________________________________________________________________________
tf.__operators__.getitem_4 (Sli ()                   0           tf.compat.v1.shape_2[0][0]       
__________________________________________________________________________________________________
tf.__operators__.getitem_6 (Sli ()                   0           tf.__operators__.getitem_5[0][0] 
__________________________________________________________________________________________________
tf.__operators__.getitem_7 (Sli ()                   0           tf.__operators__.getitem_5[0][0] 
__________________________________________________________________________________________________
tf.broadcast_to_1 (TFOpLambda)  (None, 89, 12)       0           tf.expand_dims_1[0][0]           
                                                                 tf.__operators__.getitem_4[0][0] 
                                                                 tf.__operators__.getitem_6[0][0] 
                                                                 tf.__operators__.getitem_7[0][0] 
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, 89, 32)       96          tf.stack_1[0][0]                 
__________________________________________________________________________________________________
y_conv_1_16 (Conv1D)            (None, 89, 16)       48          tf.stack_1[0][0]                 
__________________________________________________________________________________________________
y_conv_4_32 (Conv1D)            (None, 89, 32)       288         tf.stack_1[0][0]                 
__________________________________________________________________________________________________
y_conv_16_48 (Conv1D)           (None, 89, 48)       1584        tf.stack_1[0][0]                 
__________________________________________________________________________________________________
y_conv_64_64 (Conv1D)           (None, 89, 64)       8256        tf.stack_1[0][0]                 
__________________________________________________________________________________________________
tf.concat_1 (TFOpLambda)        (None, 89, 204)      0           tf.broadcast_to_1[0][0]          
                                                                 time_distributed_1[0][0]         
                                                                 y_conv_1_16[0][0]                
                                                                 y_conv_4_32[0][0]                
                                                                 y_conv_16_48[0][0]               
                                                                 y_conv_64_64[0][0]               
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) (None, 89, 512)      944128      tf.concat_1[0][0]                
__________________________________________________________________________________________________
global_max_pooling_over_time (G (None, 512)          0           bidirectional_1[0][0]            
__________________________________________________________________________________________________
upscaling_dense_3 (Dense)       (None, 1024)         525312      global_max_pooling_over_time[0][0
__________________________________________________________________________________________________
final_dense_layer_to_redefine_l (None, 240)          246000      upscaling_dense_3[0][0]          
__________________________________________________________________________________________________
tf.reshape_1 (TFOpLambda)       (None, 30, 8)        0           final_dense_layer_to_redefine_len
__________________________________________________________________________________________________
lstm (LSTM)                     (None, 30, 22)       2728        tf.reshape_1[0][0]               
__________________________________________________________________________________________________
tf.math.reduce_max (TFOpLambda) (None, 30, 1)        0           lstm[0][0]                       
__________________________________________________________________________________________________
tf.math.subtract (TFOpLambda)   (None, 30, 22)       0           lstm[0][0]                       
                                                                 tf.math.reduce_max[0][0]         
__________________________________________________________________________________________________
tf.math.exp (TFOpLambda)        (None, 30, 22)       0           tf.math.subtract[0][0]           
__________________________________________________________________________________________________
tf.math.reduce_sum (TFOpLambda) (None, 30, 1)        0           tf.math.exp[0][0]                
__________________________________________________________________________________________________
tf.math.truediv (TFOpLambda)    (None, 30, 22)       0           tf.math.exp[0][0]                
                                                                 tf.math.reduce_sum[0][0]         
==================================================================================================
Total params: 1,728,440
Trainable params: 1,728,440
Non-trainable params: 0
__________________________________________________________________________________________________
