Model: "mmproteo_transformer_20211027-142742"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
on_device_embedding (OnDevic multiple                  11264     
_________________________________________________________________
transformer_encoder (Transfo multiple                  18903040  
_________________________________________________________________
transformer_decoder (Transfo multiple                  25200640  
_________________________________________________________________
relative_position_embedding  multiple                  0         
_________________________________________________________________
dropout (Dropout)            multiple                  0         
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 44,114,944
Trainable params: 44,114,944
Non-trainable params: 0
_________________________________________________________________
