{"class_name": "Functional", "config": {"name": "mmproteo_dense_pride_20211023-131020", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2354], "dtype": "float32", "sparse": false, "ragged": false, "name": "mz_array"}, "name": "mz_array", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2354], "dtype": "float32", "sparse": false, "ragged": false, "name": "intensity_array"}, "name": "intensity_array", "inbound_nodes": []}, {"class_name": "Masking", "config": {"name": "masked_mz_array", "trainable": true, "dtype": "float32", "mask_value": 0.0}, "name": "masked_mz_array", "inbound_nodes": [[["mz_array", 0, 0, {}]]]}, {"class_name": "Masking", "config": {"name": "masked_intensity_array", "trainable": true, "dtype": "float32", "mask_value": 0.0}, "name": "masked_intensity_array", "inbound_nodes": [[["intensity_array", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.stack", "trainable": true, "dtype": "float32", "function": "stack"}, "name": "tf.stack", "inbound_nodes": [[["masked_mz_array", 0, 0, {"axis": -1}], ["masked_intensity_array", 0, 0, {"axis": -1}]]]}, {"class_name": "Flatten", "config": {"name": "flattened_masked_inputs", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flattened_masked_inputs", "inbound_nodes": [[["tf.stack", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 2048, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["flattened_masked_inputs", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 2048, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 2048, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 2048, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_3", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 1150, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_4", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.reshape", "trainable": true, "dtype": "float32", "function": "reshape"}, "name": "tf.reshape", "inbound_nodes": [["dense_4", 0, 0, {"shape": [-1, 50, 23]}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_max", "trainable": true, "dtype": "float32", "function": "math.reduce_max"}, "name": "tf.math.reduce_max", "inbound_nodes": [["tf.reshape", 0, 0, {"axis": -1, "keepdims": true}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.subtract", "trainable": true, "dtype": "float32", "function": "math.subtract"}, "name": "tf.math.subtract", "inbound_nodes": [["tf.reshape", 0, 0, {"y": ["tf.math.reduce_max", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.exp", "trainable": true, "dtype": "float32", "function": "math.exp"}, "name": "tf.math.exp", "inbound_nodes": [["tf.math.subtract", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_sum", "trainable": true, "dtype": "float32", "function": "math.reduce_sum"}, "name": "tf.math.reduce_sum", "inbound_nodes": [["tf.math.exp", 0, 0, {"axis": -1, "keepdims": true}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.truediv", "trainable": true, "dtype": "float32", "function": "math.truediv"}, "name": "tf.math.truediv", "inbound_nodes": [["tf.math.exp", 0, 0, {"y": ["tf.math.reduce_sum", 0, 0], "name": null}]]}], "input_layers": [["mz_array", 0, 0], ["intensity_array", 0, 0]], "output_layers": [["tf.math.truediv", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}