Model: "mmproteo_dense_pride_20211023-131020"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
mz_array (InputLayer)           [(None, 2354)]       0                                            
__________________________________________________________________________________________________
intensity_array (InputLayer)    [(None, 2354)]       0                                            
__________________________________________________________________________________________________
masked_mz_array (Masking)       (None, 2354)         0           mz_array[0][0]                   
__________________________________________________________________________________________________
masked_intensity_array (Masking (None, 2354)         0           intensity_array[0][0]            
__________________________________________________________________________________________________
tf.stack (TFOpLambda)           (None, 2354, 2)      0           masked_mz_array[0][0]            
                                                                 masked_intensity_array[0][0]     
__________________________________________________________________________________________________
flattened_masked_inputs (Flatte (None, 4708)         0           tf.stack[0][0]                   
__________________________________________________________________________________________________
dense (Dense)                   (None, 2048)         9644032     flattened_masked_inputs[0][0]    
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 2048)         4196352     dense[0][0]                      
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 2048)         4196352     dense_1[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 2048)         4196352     dense_2[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 1150)         2356350     dense_3[0][0]                    
__________________________________________________________________________________________________
tf.reshape (TFOpLambda)         (None, 50, 23)       0           dense_4[0][0]                    
__________________________________________________________________________________________________
tf.math.reduce_max (TFOpLambda) (None, 50, 1)        0           tf.reshape[0][0]                 
__________________________________________________________________________________________________
tf.math.subtract (TFOpLambda)   (None, 50, 23)       0           tf.reshape[0][0]                 
                                                                 tf.math.reduce_max[0][0]         
__________________________________________________________________________________________________
tf.math.exp (TFOpLambda)        (None, 50, 23)       0           tf.math.subtract[0][0]           
__________________________________________________________________________________________________
tf.math.reduce_sum (TFOpLambda) (None, 50, 1)        0           tf.math.exp[0][0]                
__________________________________________________________________________________________________
tf.math.truediv (TFOpLambda)    (None, 50, 23)       0           tf.math.exp[0][0]                
                                                                 tf.math.reduce_sum[0][0]         
==================================================================================================
Total params: 24,589,438
Trainable params: 24,589,438
Non-trainable params: 0
__________________________________________________________________________________________________
