{"class_name": "Functional", "config": {"name": "mmproteo_lstm_with_pooling_and_position_pride_20211024-121858", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2354], "dtype": "float32", "sparse": false, "ragged": false, "name": "mz_array"}, "name": "mz_array", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2354], "dtype": "float32", "sparse": false, "ragged": false, "name": "intensity_array"}, "name": "intensity_array", "inbound_nodes": []}, {"class_name": "TFOpLambda", "config": {"name": "tf.stack", "trainable": true, "dtype": "float32", "function": "stack"}, "name": "tf.stack", "inbound_nodes": [[["mz_array", 0, 0, {"axis": -1}], ["intensity_array", 0, 0, {"axis": -1}]]]}, {"class_name": "Text>RelativePositionEmbedding", "config": {"name": "relative_position_embedding", "trainable": true, "dtype": "float32", "hidden_size": 12, "min_timescale": 1.0, "max_timescale": 10000.0}, "name": "relative_position_embedding", "inbound_nodes": [[["tf.stack", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.expand_dims", "trainable": true, "dtype": "float32", "function": "expand_dims"}, "name": "tf.expand_dims", "inbound_nodes": [["relative_position_embedding", 0, 0, {"axis": 0}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.shape_1", "trainable": true, "dtype": "float32", "function": "compat.v1.shape"}, "name": "tf.compat.v1.shape_1", "inbound_nodes": [["tf.expand_dims", 0, 0, {"name": null, "out_type": "int32"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.shape", "trainable": true, "dtype": "float32", "function": "compat.v1.shape"}, "name": "tf.compat.v1.shape", "inbound_nodes": [["tf.stack", 0, 0, {"name": null, "out_type": "int32"}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_1", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_1", "inbound_nodes": [["tf.compat.v1.shape_1", 0, 0, {"slice_spec": {"start": 1, "stop": null, "step": null}}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem", "inbound_nodes": [["tf.compat.v1.shape", 0, 0, {"slice_spec": 0}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_2", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_2", "inbound_nodes": [["tf.__operators__.getitem_1", 0, 0, {"slice_spec": 0}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_3", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_3", "inbound_nodes": [["tf.__operators__.getitem_1", 0, 0, {"slice_spec": 1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.broadcast_to", "trainable": true, "dtype": "float32", "function": "broadcast_to"}, "name": "tf.broadcast_to", "inbound_nodes": [["tf.expand_dims", 0, 0, {"shape": [["tf.__operators__.getitem", 0, 0], ["tf.__operators__.getitem_2", 0, 0], ["tf.__operators__.getitem_3", 0, 0]], "name": null}]]}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "y_time_distributed_dense", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "time_distributed", "inbound_nodes": [[["tf.stack", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "y_conv_1_16", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "y_conv_1_16", "inbound_nodes": [[["tf.stack", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "y_conv_4_32", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "y_conv_4_32", "inbound_nodes": [[["tf.stack", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "y_conv_16_48", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [16], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "y_conv_16_48", "inbound_nodes": [[["tf.stack", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "y_conv_64_64", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [64], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "y_conv_64_64", "inbound_nodes": [[["tf.stack", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.concat", "trainable": true, "dtype": "float32", "function": "concat"}, "name": "tf.concat", "inbound_nodes": [[["tf.broadcast_to", 0, 0, {"axis": -1}], ["time_distributed", 0, 0, {"axis": -1}], ["y_conv_1_16", 0, 0, {"axis": -1}], ["y_conv_4_32", 0, 0, {"axis": -1}], ["y_conv_16_48", 0, 0, {"axis": -1}], ["y_conv_64_64", 0, 0, {"axis": -1}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional", "inbound_nodes": [[["tf.concat", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling_over_time", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "global_max_pooling_over_time", "inbound_nodes": [[["bidirectional", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "upscaling_dense_3", "trainable": true, "dtype": "float32", "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "upscaling_dense_3", "inbound_nodes": [[["global_max_pooling_over_time", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "final_dense_layer_to_redefine_lengths", "trainable": true, "dtype": "float32", "units": 400, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "final_dense_layer_to_redefine_lengths", "inbound_nodes": [[["upscaling_dense_3", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.reshape", "trainable": true, "dtype": "float32", "function": "reshape"}, "name": "tf.reshape", "inbound_nodes": [["final_dense_layer_to_redefine_lengths", 0, 0, {"shape": [-1, 50, 8]}]]}, {"class_name": "LSTM", "config": {"name": "final_lstm", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 23, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "final_lstm", "inbound_nodes": [[["tf.reshape", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_max", "trainable": true, "dtype": "float32", "function": "math.reduce_max"}, "name": "tf.math.reduce_max", "inbound_nodes": [["final_lstm", 0, 0, {"axis": -1, "keepdims": true}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.subtract", "trainable": true, "dtype": "float32", "function": "math.subtract"}, "name": "tf.math.subtract", "inbound_nodes": [["final_lstm", 0, 0, {"y": ["tf.math.reduce_max", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.exp", "trainable": true, "dtype": "float32", "function": "math.exp"}, "name": "tf.math.exp", "inbound_nodes": [["tf.math.subtract", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_sum", "trainable": true, "dtype": "float32", "function": "math.reduce_sum"}, "name": "tf.math.reduce_sum", "inbound_nodes": [["tf.math.exp", 0, 0, {"axis": -1, "keepdims": true}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.truediv", "trainable": true, "dtype": "float32", "function": "math.truediv"}, "name": "tf.math.truediv", "inbound_nodes": [["tf.math.exp", 0, 0, {"y": ["tf.math.reduce_sum", 0, 0], "name": null}]]}], "input_layers": [["mz_array", 0, 0], ["intensity_array", 0, 0]], "output_layers": [["tf.math.truediv", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}