Model: "mmproteo_lstm_with_pooling_and_position_pride_20211024-121858"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
mz_array (InputLayer)           [(None, 2354)]       0                                            
__________________________________________________________________________________________________
intensity_array (InputLayer)    [(None, 2354)]       0                                            
__________________________________________________________________________________________________
tf.stack (TFOpLambda)           (None, 2354, 2)      0           mz_array[0][0]                   
                                                                 intensity_array[0][0]            
__________________________________________________________________________________________________
relative_position_embedding (Re (2354, 12)           0           tf.stack[0][0]                   
__________________________________________________________________________________________________
tf.expand_dims (TFOpLambda)     (1, 2354, 12)        0           relative_position_embedding[0][0]
__________________________________________________________________________________________________
tf.compat.v1.shape_1 (TFOpLambd (3,)                 0           tf.expand_dims[0][0]             
__________________________________________________________________________________________________
tf.compat.v1.shape (TFOpLambda) (3,)                 0           tf.stack[0][0]                   
__________________________________________________________________________________________________
tf.__operators__.getitem_1 (Sli (2,)                 0           tf.compat.v1.shape_1[0][0]       
__________________________________________________________________________________________________
tf.__operators__.getitem (Slici ()                   0           tf.compat.v1.shape[0][0]         
__________________________________________________________________________________________________
tf.__operators__.getitem_2 (Sli ()                   0           tf.__operators__.getitem_1[0][0] 
__________________________________________________________________________________________________
tf.__operators__.getitem_3 (Sli ()                   0           tf.__operators__.getitem_1[0][0] 
__________________________________________________________________________________________________
tf.broadcast_to (TFOpLambda)    (None, 2354, 12)     0           tf.expand_dims[0][0]             
                                                                 tf.__operators__.getitem[0][0]   
                                                                 tf.__operators__.getitem_2[0][0] 
                                                                 tf.__operators__.getitem_3[0][0] 
__________________________________________________________________________________________________
time_distributed (TimeDistribut (None, 2354, 32)     96          tf.stack[0][0]                   
__________________________________________________________________________________________________
y_conv_1_16 (Conv1D)            (None, 2354, 16)     48          tf.stack[0][0]                   
__________________________________________________________________________________________________
y_conv_4_32 (Conv1D)            (None, 2354, 32)     288         tf.stack[0][0]                   
__________________________________________________________________________________________________
y_conv_16_48 (Conv1D)           (None, 2354, 48)     1584        tf.stack[0][0]                   
__________________________________________________________________________________________________
y_conv_64_64 (Conv1D)           (None, 2354, 64)     8256        tf.stack[0][0]                   
__________________________________________________________________________________________________
tf.concat (TFOpLambda)          (None, 2354, 204)    0           tf.broadcast_to[0][0]            
                                                                 time_distributed[0][0]           
                                                                 y_conv_1_16[0][0]                
                                                                 y_conv_4_32[0][0]                
                                                                 y_conv_16_48[0][0]               
                                                                 y_conv_64_64[0][0]               
__________________________________________________________________________________________________
bidirectional (Bidirectional)   (None, 2354, 512)    944128      tf.concat[0][0]                  
__________________________________________________________________________________________________
global_max_pooling_over_time (G (None, 512)          0           bidirectional[0][0]              
__________________________________________________________________________________________________
upscaling_dense_3 (Dense)       (None, 1024)         525312      global_max_pooling_over_time[0][0
__________________________________________________________________________________________________
final_dense_layer_to_redefine_l (None, 400)          410000      upscaling_dense_3[0][0]          
__________________________________________________________________________________________________
tf.reshape (TFOpLambda)         (None, 50, 8)        0           final_dense_layer_to_redefine_len
__________________________________________________________________________________________________
final_lstm (LSTM)               (None, 50, 23)       2944        tf.reshape[0][0]                 
__________________________________________________________________________________________________
tf.math.reduce_max (TFOpLambda) (None, 50, 1)        0           final_lstm[0][0]                 
__________________________________________________________________________________________________
tf.math.subtract (TFOpLambda)   (None, 50, 23)       0           final_lstm[0][0]                 
                                                                 tf.math.reduce_max[0][0]         
__________________________________________________________________________________________________
tf.math.exp (TFOpLambda)        (None, 50, 23)       0           tf.math.subtract[0][0]           
__________________________________________________________________________________________________
tf.math.reduce_sum (TFOpLambda) (None, 50, 1)        0           tf.math.exp[0][0]                
__________________________________________________________________________________________________
tf.math.truediv (TFOpLambda)    (None, 50, 23)       0           tf.math.exp[0][0]                
                                                                 tf.math.reduce_sum[0][0]         
==================================================================================================
Total params: 1,892,656
Trainable params: 1,892,656
Non-trainable params: 0
__________________________________________________________________________________________________
